In [1]:
import pandas as pd

# Création à partir d'un dictionnaire
data = {
    'Nom': ['Alice', 'Charles', 'Ahmed','Bob'],
    'Âge': [24, 27, 22, 31],
    'Ville': ['Douala', 'Yaoundé', 'Garoua', 'Buea']
}

df = pd.DataFrame(data)

In [2]:
df

       Nom  Âge    Ville
0    Alice   24   Douala
1  Charles   27  Yaoundé
2    Ahmed   22   Garoua
3      Bob   31     Buea

In [3]:
df_note = pd.read_csv('data.csv')
df_note

  Etudiant  Note    Ville
0    Alice    14   Douala
1  Charles    12  Yaoundé
2    Ahmed    13   Garoua
3      Bob    12     Buea

In [4]:
df_note.to_csv('output_data.csv', index = False)

In [5]:
df_note.head(2)

  Etudiant  Note    Ville
0    Alice    14   Douala
1  Charles    12  Yaoundé

In [6]:
df_note.tail(2)

  Etudiant  Note   Ville
2    Ahmed    13  Garoua
3      Bob    12    Buea

In [7]:
df_note.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Etudiant  4 non-null      object
 1   Note      4 non-null      int64
 2   Ville     4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [8]:
df_note[['Etudiant']]

  Etudiant
0    Alice
1  Charles
2    Ahmed
3      Bob

In [9]:
df_note[['Etudiant', 'Note']]

  Etudiant  Note
0    Alice    14
1  Charles    12
2    Ahmed    13
3      Bob    12

In [10]:
df_note.iloc[1:3]

  Etudiant  Note    Ville
1  Charles    12  Yaoundé
2    Ahmed    13   Garoua

In [11]:
df_note[df_note['Note'] > 12]

  Etudiant  Note   Ville
0    Alice    14  Douala
2    Ahmed    13  Garoua

In [12]:
df_note['Pays'] = 'Cameroun'
df_note

  Etudiant  Note    Ville      Pays
0    Alice    14   Douala  Cameroun
1  Charles    12  Yaoundé  Cameroun
2    Ahmed    13   Garoua  Cameroun
3      Bob    12     Buea  Cameroun

In [13]:
df_note.loc[0, 'Note'] = 15
df_note

  Etudiant  Note    Ville      Pays
0    Alice    15   Douala  Cameroun
1  Charles    12  Yaoundé  Cameroun
2    Ahmed    13   Garoua  Cameroun
3      Bob    12     Buea  Cameroun

In [14]:
# Supprimer la colonne 'Pays'
df_note = df_note.drop(columns=['Pays'])
df_note

  Etudiant  Note    Ville
0    Alice    15   Douala
1  Charles    12  Yaoundé
2    Ahmed    13   Garoua
3      Bob    12     Buea

In [15]:
# Supprimer une ligne
df_note = df_note.drop(index=1)
df_note

  Etudiant  Note   Ville
0    Alice    15  Douala
2    Ahmed    13  Garoua
3      Bob    12    Buea

In [16]:
# Trier les notes
df_note = df_note.sort_values(by='Note')
df_note

  Etudiant  Note   Ville
3      Bob    12    Buea
2    Ahmed    13  Garoua
0    Alice    15  Douala

In [17]:
df_note = pd.read_csv('data.csv')
df_note

  Etudiant  Note    Ville
0    Alice    14   Douala
1  Charles    12  Yaoundé
2    Ahmed    13   Garoua
3      Bob    12     Buea

In [18]:
df_geo = pd.read_csv('data_sup.csv')
df_geo

  Etudiant     Région Date naissance
0    Alice   Littoral     04/03/2003
1  Charles     Centre     08/08/2008
2    Ahmed       Nord     23/12/2004
3      Bob  Sud-Ouest     14/05/2005

In [19]:
# Fusionner les dataframes

df_merged = pd.merge(df_note, df_geo, on = 'Etudiant')
df_merged

  Etudiant  Note    Ville     Région Date naissance
0    Alice    14   Douala   Littoral     04/03/2003
1  Charles    12  Yaoundé     Centre     08/08/2008
2    Ahmed    13   Garoua       Nord     23/12/2004
3      Bob    12     Buea  Sud-Ouest     14/05/2005

In [20]:
# Détecter les valeurs manquantes
df_merged.isnull().sum()

# Remplacer les valeurs manquantes par une valeur spécifique
# Ici, la valeur de remplacement c'est 0
df_merged.fillna(0, inplace=True)

# Supprimer les lignes avec des valeurs manquantes
df_merged.dropna(inplace=True)

In [22]:
# Détecter les valeurs manquantes
df_merged.isnull().sum()

Etudiant          0
Note              0
Ville             0
Région            0
Date naissance    0
dtype: int64

In [ ]:
# Supprimer les lignes avec des valeurs manquantes
df_merged.dropna(inplace=True)